#ifndef __EXTI_H
#define __EXTI_H



//===========================================================================================================================//
//===========================================================================================================================//
//                                                        外部中断接口                                                        //
//===========================================================================================================================//
//===========================================================================================================================//



// GPIO外中断触发类型
typedef enum _eExtiType
{
	eEXTI_BOTH_EDGE, // 任意电平触发
	eEXTI_RISING_EDGE,  // 上升沿触发
	eEXTI_FALLING_EDGE, // 下降沿触发
}eExtiType_t;


/********************************************************
 * 函数功能：外部中断配置函数，每次只能配置一个引脚(配置完立即使能中断，配置之后需重新注册回调函数)
 * 形    参：pin：指定GPIO引脚
             trim：中断触发模式
             pCallBack：回调函数指针
             parg：回调函数的参数
 * 返 回 值：0=成功
             1=回调函数指针为NULL
             2=GPIO引脚错误
 * 开 发 者：王志超
 * 维护日期：2020年5月6日
 * 修订日志：开发
 ********************************************************/
unsigned int exti_enable(unsigned int pin, eExtiType_t trim);


/********************************************************
 * 函数功能：外部中断禁能配置，每次只配置一个引脚
 * 形    参：pin：指定GPIO引脚
 * 返 回 值：无
 * 开 发 者：王志超
 * 维护日期：2020年5月6日
 * 修订日志：开发
 ********************************************************/
void exti_disable(unsigned int pin);











#endif


